Tekla.Structures.ModelInternal.EventHandler
EventHandler is a class that TS calls when an event is raised. Handler
then calls all the listener "Events" objects.

Tekla.Structures.ModelInternal.EventHandler.OBJECT_NUMBERED
Object numbered event

Tekla.Structures.ModelInternal.EventHandler.MAX_0BJECT_COUNT_IN_LIST
Object numbered event

Tekla.Structures.ModelInternal.EventHandler.EventListeners
List of Events objects waiting to be called

Tekla.Structures.ModelInternal.EventHandler.EventSubscribers
List of Events objects waiting to be called

Tekla.Structures.ModelInternal.EventHandler.UIEventListeners
List of UI Events objects waiting to be called

Tekla.Structures.ModelInternal.EventHandler.activeUIClientID
active client ID for UI event

Tekla.Structures.ModelInternal.EventHandler.AddListener(Tekla.Structures.Model.IEvents)
DO NOT USE! For internal usage only!
eventListener:

Tekla.Structures.ModelInternal.EventHandler.AddUIListener(Tekla.Structures.ModelInternal.dotClientId_t,Tekla.Structures.ModelInternal.IInputGeometryEvents)
DO NOT USE! For internal usage only!
ClientID:
eventListener:

Tekla.Structures.ModelInternal.EventHandler.RemoveListener(Tekla.Structures.Model.IEvents)
DO NOT USE! For internal usage only!
eventListener:

Tekla.Structures.ModelInternal.EventHandler.RemoveUIListener(Tekla.Structures.ModelInternal.dotClientId_t,Tekla.Structures.ModelInternal.IInputGeometryEvents)
DO NOT USE! For internal usage only!
ClientID:
eventListener:

Tekla.Structures.ModelInternal.EventHandler.SubscribeEvent(System.String,Tekla.Structures.Model.IEvents)
Registers an event listener to the event
eventName:  name of the event to subscribe to
eventListener:  Event Listener who is interested in the event
Returns: success/failure

Tekla.Structures.ModelInternal.EventHandler.UnsubscribeEvent(System.String,Tekla.Structures.Model.IEvents)
Unregisters an event listener to the event
eventName:  name of the event to subscribe to
eventListener:  Event Listener who is interested in the event
Returns: success/failure

Tekla.Structures.ModelInternal.EventHandler.OnEvent(System.String)
TS calls when event is raised.
param: Name of the event
Returns: 1

Tekla.Structures.ModelInternal.EventHandler.GetDetectedClash
Gets the data of the detected clash in dotClash_t struct and sets the attributes
to its ClashCheckData object parameter.

Tekla.Structures.ModelInternal.EventHandler.GetNumberOfClashes
Gets the number of clashes that have been found when the clash check has been
started from .NET API.

Tekla.Structures.ModelInternal.EventHandler.GetViewIdForCameraChangedEvent
Gets the view id for camera changed event

Tekla.Structures.ModelInternal.EventHandler.GetPointInputChangedEvent
Gets the latest command status change.

Tekla.Structures.ModelInternal.EventHandler.GetCommandStatus(System.String@,System.String@,System.Boolean@)
Gets the latest command status change.

Tekla.Structures.ModelInternal.EventHandler.GetTrackEvent(System.String@,System.String@,System.String@)
Gets the track event change.

Tekla.Structures.ModelInternal.EventHandler.GetCommitData(Tekla.Structures.Model.ModelObject@,System.Int32@,System.Int32@)
Gets the commit event data.